
#Chỉ thay 1 layer ở cuối 
nc: 80
scale: s

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Paper1_yolov12.yaml
nc: 1

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                 # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                # 1-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]]         # 2
  - [-1, 1, Conv, [256, 3, 2]]                # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]]         # 4
  - [-1, 1, Conv, [256, 3, 2]]                # 5-P4/16
  - [-1, 2, C2f_CA, [256, True, 1, 0.5]]      # 6
  - [-1, 1, Conv, [512, 3, 2]]                # 7-P5/32
  - [-1, 2, C2f_CA, [512, True, 1, 0.5]]      # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 9
  - [[-1, 6], 1, Concat, [1]]                    # 10
  - [-1, 1, A2C2f, [256, False, -1]]             # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 4], 1, Concat, [1]]                    # 13
  - [-1, 1, A2C2f, [128, False, -1]]             # 14 (P3/8-small)

  - [-1, 1, Conv, [128, 3, 2]]                   # 15
  - [[-1, 11], 1, Concat, [1]]                   # 16
  - [-1, 1, A2C2f, [256, False, -1]]             # 17 (P4/16-medium)

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 8], 1, Concat, [1]]                    # 19
  - [-1, 1, C3k2, [512, True]]                   # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]              # 21

