# YOLOv12 CoordAtt - chỉ thay backbone sâu
#BẢN V1 : chạy coordinate attention
# nc: 80
# scale: s
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# backbone:
#   - [-1, 1, Conv,   [64, 3, 2]]
#   - [-1, 1, Conv,   [128, 3, 2, 1, 2]]
#   - [-1, 2, C3k2,   [256, False, 0.25]]
#   - [-1, 1, Conv,   [256, 3, 2, 1, 4]]
#   - [-1, 2, C3k2,   [512, False, 0.25]]
#   - [-1, 1, Conv,   [512, 3, 2]]
#   - [-1, 4, C2f_CA, [512, True, 1, 0.5]]        # 6
#   - [-1, 1, Conv,   [1024, 3, 2]]
#   - [-1, 4, C2f_CA, [1024, True, 1, 0.5]]

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]]
#   - [-1, 2, A2C2f, [512, False, -1]]

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]]
#   - [-1, 2, A2C2f, [256, False, -1]]

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 11], 1, Concat, [1]]
#   - [-1, 2, A2C2f, [512, False, -1]]

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 8], 1, Concat, [1]]
#   - [-1, 2, C3k2, [1024, True]]

#   - [[14, 17, 20], 1, Detect, [nc]]
# 






#BẢN V2 chạy ECA
# nc: 80
# scale: s
# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# backbone:
#   - [-1, 1, Conv,     [64, 3, 2]]
#   - [-1, 1, Conv,     [128, 3, 2, 1, 2]]
#   - [-1, 2, C3k2,     [256, False, 0.25]]
#   - [-1, 1, Conv,     [256, 3, 2, 1, 4]]
#   - [-1, 2, C3k2,     [512, False, 0.25]]
#   - [-1, 1, Conv,     [512, 3, 2]]
#   - [-1, 4, C2f_ECA,  [512, True, 1, 0.5]]
#   - [-1, 1, Conv,     [1024, 3, 2]]
#   - [-1, 4, C2f_ECA,  [1024, True, 1, 0.5]]

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]]
#   - [-1, 2, A2C2f, [512, False, -1]]

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]]
#   - [-1, 2, A2C2f, [256, False, -1]]

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 11], 1, Concat, [1]]
#   - [-1, 2, A2C2f, [512, False, -1]]

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 8], 1, Concat, [1]]
#   - [-1, 2, C3k2, [1024, True]]

#   - [[14, 17, 20], 1, Detect, [nc]]



#THAY KHỐI MẠNH
# YOLOv12 - A2C2f -> C2f_CA
# Mục tiêu: nhẹ hơn, nhanh hơn, cố giữ hoặc tăng nhẹ mAP so với baseline

# nc: 80
# scale: s

# scales:
#   n: [0.50, 0.25, 1024]
#   s: [0.50, 0.50, 1024]
#   m: [0.50, 1.00, 512]
#   l: [1.00, 1.00, 512]
#   x: [1.00, 1.50, 512]

# backbone:
#   - [-1, 1, Conv, [64, 3, 2]]
#   - [-1, 1, Conv, [128, 3, 2, 1, 2]]
#   - [-1, 2, C3k2, [256, False, 0.25]]
#   - [-1, 1, Conv, [256, 3, 2, 1, 4]]
#   - [-1, 2, C3k2, [512, False, 0.25]]
#   - [-1, 1, Conv, [512, 3, 2]]
#   - [-1, 2, C2f_CA, [512, False, 1, 0.5, 32]]
#   - [-1, 1, Conv, [1024, 3, 2]]
#   - [-1, 2, C2f_CA, [1024, False, 1, 0.5, 32]]

# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 6], 1, Concat, [1]]
#   - [-1, 2, A2C2f, [512, False, -1]]

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]]
#   - [-1, 2, A2C2f, [256, False, -1]]

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 11], 1, Concat, [1]]
#   - [-1, 2, A2C2f, [512, False, -1]]

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 8], 1, Concat, [1]]
#   - [-1, 2, C3k2, [1024, True]]

#   - [[14, 17, 20], 1, Detect, [nc]]


#Chỉ thay 1 layer ở cuối 
nc: 80
scale: s

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2, 1, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2, 1, 4]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 4, A2C2f_ECA, [512, True, 2]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 4, A2C2f_ECA, [1024, True, 2]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[14, 17, 20], 1, Detect, [nc]]

